---
kind: type
id: T:Autodesk.Revit.DB.PointCloudFoundStatus
source: html/4fde9174-a6f0-1ba4-7b87-c8ca5cb034d9.htm
---
# Autodesk.Revit.DB.PointCloudFoundStatus

Enumerated type representing the possible states related to searching for a point cloud file.

## Syntax (C#)
```csharp
public enum PointCloudFoundStatus
```